//===============================================//
//  Файл:               Program.cs
//  Назначение:         Главный файл
//  Разработчик:        InterWave Partnership
//===============================================//
//===============================================//
//  Подключение компонентов
//===============================================//
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using System.Windows.Forms;

//===============================================//
//  Создаем пространство имен
//===============================================//
namespace W2W_SDK{
    //===============================================//
    //  Создаем глобальный класс приложения
    //===============================================//
    static class Program{
        /// <summary>
        /// Главная точка входа для приложения.
        /// </summary>
        [STAThread]
        static void Main(){ // Инициализируем
            Application.EnableVisualStyles(); // Включаем визуальные стили
            Application.SetCompatibleTextRenderingDefault(false); // Включаем поддержку рендеринга текста по умолчанию
            Application.Run(new MainForm()); // Создаем сплеш скрин
        }
    }
}
