//===============================================//
//  Файл:               Splash.cs
//  Назначение:         Сплеш-скрин программы
//  Разработчик:        InterWave Partnership
//===============================================//
//===============================================//
//  Подключение компонентов
//===============================================//
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

//===============================================//
//  Создаем пространство имен
//===============================================//
namespace W2W_SDK{
    //===============================================//
    //  Класс Splash-скрина приложения
    //===============================================//
    public partial class Splash : Form{
        //===============================================//
        //  Конструктор класса
        //===============================================//
        public Splash(){
            InitializeComponent(); // Инициализировать компонент
        }

        //===============================================//
        //  Действие при загрузке формы
        //===============================================//
        private void Splash_Load(object sender, EventArgs e){
        }

        //===============================================//
        //  Действие при отображении формы
        //===============================================//
        private void Splash_Shown(object sender, EventArgs e){
            // Показываем Splash
            System.Threading.Thread.Sleep(5000); // Ждать 5 секунд
            this.Close(); // Закрыть форму
        }
    }
}
